MS71/LMROS/esp32_fw/main/app_main.cpp
// Copyright 2015-2017 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <exception>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/time.h>

#include "../components/http_server/my_http_server.h"
#include "esp_ota_ops.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "ota_server.h"

#include <esp_task_wdt.h>
#include <driver/adc.h>
#include <esp_adc_cal.h>
#ifdef CONFIG_IDF_TARGET_ESP32S2
#include <driver/adc_common.h>
#endif
#include "driver/gpio.h"
#include "driver/i2c.h"
#ifndef CONFIG_IDF_TARGET_ESP32S2
#include "driver/sdmmc_host.h"
#endif
#include "driver/sdspi_host.h"
#include "driver/spi_master.h"
#include "driver/uart.h"
#include "esp_console.h"
#include "esp_err.h"
#include "esp_event.h"
#include "esp_event_legacy.h"
#include "esp_log.h"
#include "esp_pm.h"
#include "esp_sleep.h"
#ifdef CONFIG_ENABLE_SPIFS
#include "esp_spiffs.h"
#endif
#include "driver/rtc_io.h"
#include "esp32/rom/uart.h"
#include "esp_system.h"
#include "esp_vfs.h"
#include "esp_vfs_dev.h"
#include "esp_vfs_fat.h"
#include "esp_wifi.h"
#include "i2chandler.h"
#include "nvs_flash.h"
#include "sdmmc_cmd.h"
#if CONFIG_IDF_TARGET_ESP32S2
#include "driver/temp_sensor.h"
#endif
#include "lwip/err.h"
#include "lwip/netdb.h"
#include "lwip/sockets.h"
#include "lwip/sys.h"

#include "ssd1306.h"
#include "ssd1306_default_if.h"
#include "ssd1306_draw.h"
#include "ssd1306_font.h"

#include "cam.h"
#include "gps.h"
#ifdef CONFIG_ENABLE_ROS2
#include "ros2node.h"
#endif
#ifdef CONFIG_ENABLE_WEBUI
#include "webui.h"
#endif

#include "console.h"

#ifdef CONFIG_ESP32S2_ULP_COPROC_ENABLED
#include "esp32/ulp.h"
#include "ulp_main.h"

extern const uint8_t ulp_main_bin_start[] asm("_binary_ulp_main_bin_start");
extern const uint8_t ulp_main_bin_end[] asm("_binary_ulp_main_bin_end");
#endif

void beep(int onoff);

// static esp_err_t event_handler(void* ctx, system_event_t* event);
void check_wifi_config();
void initialise_wifi(void);

// static char my_wifi_ssid[64] = {};
// static char my_wifi_psk[64] = {};
// static bool my_wifi_save_on_connected = false;

#ifdef CONFIG_ENABLE_SDCARD
sdmmc_card_t* card = NULL;
bool sdcard_ready = true;
#endif

#ifdef CONFIG_ENABLE_CAMERA
bool camera_ready = true;
#endif

static const char* TAG = "MAIN";

extern EventGroupHandle_t wifi_event_group;
const int CONNECTED_BIT = BIT0;

static esp_pm_lock_handle_t pmlock_cpu;
static esp_pm_lock_handle_t pmlock_ahb;
static esp_pm_lock_handle_t pmlock_wifi;
static int pmlock_cnt = 0;

void pm_init()
{
#if CONFIG_PM_ENABLE
    ESP_LOGI(TAG, "starting pm ...");
    // Configure dynamic frequency scaling:
    // maximum and minimum frequencies are set in sdkconfig,
    // automatic light sleep is enabled if tickless idle support is enabled.
#ifdef CONFIG_IDF_TARGET_ESP32S2
    esp_pm_config_esp32s2_t pm_config = {};
#else
    esp_pm_config_esp32_t pm_config = {};
#endif
    pm_config.max_freq_mhz = 240;
#ifdef CONFIG_IDF_TARGET_ESP32S2
    pm_config.min_freq_mhz = 10;
#else
    pm_config.min_freq_mhz = 40;
#endif
#if CONFIG_FREERTOS_USE_TICKLESS_IDLE
    pm_config.light_sleep_enable = true;
#endif
    ESP_ERROR_CHECK(esp_pm_configure(&pm_config));
#endif // CONFIG_PM_ENAB    
    esp_pm_lock_create(ESP_PM_CPU_FREQ_MAX, 0, "pm_lock_wifi", &pmlock_cpu);    
    esp_pm_lock_create(ESP_PM_APB_FREQ_MAX, 0, "pm_lock_ahb", &pmlock_ahb);    
    esp_pm_lock_create(ESP_PM_NO_LIGHT_SLEEP, 0, "pm_lock_wifi", &pmlock_wifi);    
    pmlock_cnt = 0;
}

int pm_cnt()
{
    return pmlock_cnt;
}

void pm_ref()
{
    pmlock_cnt++;
    ESP_LOGV(TAG, "pmlock_cnt=%d",pmlock_cnt);
#if CONFIG_PM_ENABLE
    if( pmlock_cnt > 0 )
    {
        ESP_LOGV(TAG, "pmlock_cnt=%d aquire",pmlock_cnt);
        esp_pm_lock_acquire(pmlock_cpu);  
        esp_pm_lock_acquire(pmlock_ahb);  
        esp_pm_lock_acquire(pmlock_wifi);  
    }
#endif
}

void pm_unref()
{
    pmlock_cnt--;
    if( pmlock_cnt < 0 )
    {
        ESP_LOGE(TAG, "pmlock_cnt=%d",pmlock_cnt);
    }
    else
    {
        ESP_LOGV(TAG, "pmlock_cnt=%d",pmlock_cnt);
    }
#if CONFIG_PM_ENABLE
    if( pmlock_cnt <= 0 )
    {
        ESP_LOGV(TAG, "pmlock_cnt=%d release",pmlock_cnt);
        esp_pm_lock_release(pmlock_cpu);  
        esp_pm_lock_release(pmlock_ahb);  
        esp_pm_lock_release(pmlock_wifi);  
    }
#endif
}

// esp_ip4_addr_t s_ip_addr = {};
// uint8_t s_ip_addr_changed = 1;

#if defined(CONFIG_PARTITION_TABLE_CUSTOM) || defined(CONFIG_PARTITION_TABLE_TWO_OTA)
/**
 * @brief
 * @param param
 */
static void ota_server_task(void* param)
{
    ESP_LOGI(TAG, "ota task ...");
    xEventGroupWaitBits(wifi_event_group, CONNECTED_BIT, false, true, portMAX_DELAY);

    ota_server_start();
    vTaskDelete(NULL);
}
#endif

#ifdef CONFIG_ENABLE_SDCARD

// ESP32-S2 and ESP32-C3 doesn't have an SD Host peripheral, always use SPI:
#if CONFIG_IDF_TARGET_ESP32S2 ||CONFIG_IDF_TARGET_ESP32C3
#ifndef USE_SPI_MODE
#define USE_SPI_MODE
#endif // USE_SPI_MODE
// on ESP32-S2, DMA channel must be the same as host id
#define SPI_DMA_CHAN    host.slot
#endif //CONFIG_IDF_TARGET_ESP32S2

// DMA channel to be used by the SPI peripheral
#ifndef SPI_DMA_CHAN
#define SPI_DMA_CHAN    1
#endif //SPI_DMA_CHAN

/**
 * @brief
 * @param param
 */
static void sd_test_task(void* param)
{
    ESP_LOGW(TAG, "sd_test_task() %d ",sdcard_ready);
    if(sdcard_ready == true )
    {
        uint8_t fn_idx = 0;
        char fn[64];
        // Card has been initialized, print its properties
        sdmmc_card_print_info(stdout, card);

        while(1)
        {
            size_t sd_test_buf_size = 32 * 1024;
            uint8_t* sd_test_buf = (uint8_t*)malloc(sd_test_buf_size);
            if(sd_test_buf != NULL)
            {
                memset(sd_test_buf, 0, sd_test_buf_size);
                // Use POSIX and C standard library functions to work with files.
                // First create a file.
                sprintf(fn, "/sdcard/hello-%d.bin", fn_idx++);
                FILE* f = fopen(fn, "w");
                if(f == NULL)
                {
                    ESP_LOGE(TAG, "Failed to open file for writing");
                }
                else
                {
                    int n,r;
                    uint32_t i = 0;
                    int64_t t = esp_timer_get_time();
                    for(n=0;n<(8*4*8);n++)
                    {
                        pm_ref();
                        r = fwrite(sd_test_buf, 1, sd_test_buf_size, f);
                        pm_unref();
                        if( r != sd_test_buf_size )
                        {
                            ESP_LOGE(TAG, "fwrite error %d",r);
                            break;
                        }
                        i += r;
                        esp_task_wdt_reset();
                    }
                    fflush(f);
                    if((esp_timer_get_time() - t) != 0)
                    {
                        ESP_LOGI(TAG, "File (%s) written %dMByte %dkB/s", fn, 
                            (int)((i) / (1024 * 1024)),
                            (int)((1000 * i) / (esp_timer_get_time() - t)));
                    }
                    fclose(f);
                }

                {
                    f = fopen(fn, "r");
                    if(f == NULL)
                    {
                        ESP_LOGE(TAG, "Failed to open file for reading");
                    }
                    else
                    {
                        int64_t t = esp_timer_get_time();
                        size_t i = 0;
                        while(!feof(f))
                        {
                            pm_ref();
                            int r = fread(sd_test_buf, 1, sd_test_buf_size, f);
                            pm_unref();
                            if( r < 0 )
                            {
                                ESP_LOGE(TAG, "fread error %d",r);
                                break;
                            }
                            i += r; 
                            esp_task_wdt_reset();
                        }
                        if((esp_timer_get_time() - t) != 0)
                        {
                            ESP_LOGI(TAG, "File (%s) read %dMByte %dkB/s", fn, 
                                (int)((i) / (1024 * 1024)),
                                (int)((1000 * i) / (esp_timer_get_time() - t)));
                        }
                        fclose(f);
                    }
                }
                free(sd_test_buf);
            }

            vTaskDelay(1000 / portTICK_PERIOD_MS);
        }
    }
    vTaskDelete(NULL);
}

/**
 * @brief
 */
void sdmmc_init()
{
    esp_err_t ret;
#ifndef USE_SPI_MODE
    ESP_LOGI(TAG, "Using SDMMC peripheral");
    sdmmc_host_t host = SDMMC_HOST_DEFAULT();

    host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;

    // This initializes the slot without card detect (CD) and write protect (WP) signals.
    // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these signals.
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();

