MS71/LMROS/esp32_fw/main/app_main.cpp
    // To use 1-line SD mode, uncomment the following line:
    slot_config.width = 1;

    // GPIOs 15, 2, 4, 12, 13 should have external 10k pull-ups.
    // Internal pull-ups are not sufficient. However, enabling internal pull-ups
    // does make a difference some boards, so we do that here.
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_MOSI, GPIO_PULLUP_ONLY); // CMD, needed in 4- and 1- line modes
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_MISO, GPIO_PULLUP_ONLY); // D0, needed in 4- and 1-line modes
    // gpio_set_pull_mode(4, GPIO_PULLUP_ONLY);    // D1, needed in 4-line mode only
    // gpio_set_pull_mode(12, GPIO_PULLUP_ONLY);   // D2, needed in 4-line mode only
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_CS, GPIO_PULLUP_ONLY);  // D3, needed in 4- and 1-line modes
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_CLK, GPIO_PULLUP_ONLY); // CLK, needed in 4- and 1-line modes

#else
    ESP_LOGI(TAG, "Using SPI peripheral");

    // GPIOs 15, 2, 4, 12, 13 should have external 10k pull-ups.
    // Internal pull-ups are not sufficient. However, enabling internal pull-ups
    // does make a difference some boards, so we do that here.
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_MOSI, GPIO_PULLUP_ONLY); // CMD, needed in 4- and 1- line modes
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_MISO, GPIO_PULLUP_ONLY); // D0, needed in 4- and 1-line modes
    // gpio_set_pull_mode(4, GPIO_PULLUP_ONLY);    // D1, needed in 4-line mode only
    // gpio_set_pull_mode(12, GPIO_PULLUP_ONLY);   // D2, needed in 4-line mode only
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_CS, GPIO_PULLUP_ONLY);  // D3, needed in 4- and 1-line modes
    gpio_set_pull_mode((gpio_num_t)SDSPI_PIN_NUM_CLK, GPIO_PULLUP_ONLY); // CLK, needed in 4- and 1-line modes

    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    spi_bus_config_t bus_cfg = {
        .mosi_io_num = SDSPI_PIN_NUM_MOSI,
        .miso_io_num = SDSPI_PIN_NUM_MISO,
        .sclk_io_num = SDSPI_PIN_NUM_CLK,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4000,
    };

    ESP_LOGI(TAG, "SDSPI using dma %d",SPI_DMA_CHAN);
    ret = spi_bus_initialize((spi_host_device_t)host.slot, &bus_cfg, SPI_DMA_CHAN);
    if(ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to initialize bus.");
        return;
    }
    
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs = SDSPI_PIN_NUM_CS;
    slot_config.host_id = (spi_host_device_t)host.slot;
#endif // USE_SPI_MODE

    // Options for mounting the filesystem.
    // If format_if_mount_failed is set to true, SD card will be partitioned and
    // formatted in case when mounting fails.
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = true, .max_files = 16, .allocation_unit_size = 16 * 1024
    };

    // Use settings defined above to initialize SD card and mount FAT filesystem.
    // Note: esp_vfs_fat_sdmmc_mount is an all-in-one convenience function.
    // Please check its source code and implement error recovery when developing
    // production applications.
#ifndef USE_SPI_MODE
    ret = esp_vfs_fat_sdmmc_mount("/sdcard", &host, &slot_config, &mount_config, &card);
#else
    ret = esp_vfs_fat_sdspi_mount("/sdcard", &host, &slot_config, &mount_config, &card);
#endif
    if(ret != ESP_OK)
    {
        if(ret == ESP_FAIL)
        {
            ESP_LOGE(TAG,
                "Failed to mount filesystem. "
                "If you want the card to be formatted, set format_if_mount_failed = true.");
        }
        else
        {
            ESP_LOGE(TAG,
                "Failed to initialize the card (%s). "
                "Make sure SD card lines have pull-up resistors in place.",
                esp_err_to_name(ret));
        }
        sdcard_ready = false;
    }
    else
    {
        ESP_LOGI(TAG, "sdcard mounted");
        sdcard_ready = true;
    }
}
#endif

#ifdef CONFIG_ENABLE_SPI
spi_device_handle_t spi;

spi_bus_config_t buscfg = {};
spi_device_interface_config_t devcfg = {};

void spihost_init()
{
    esp_err_t ret;

    gpio_set_direction(SPIHOST_PIN_NUM_CS, GPIO_MODE_OUTPUT);

    buscfg.miso_io_num = SPIHOST_PIN_NUM_MISO;
    buscfg.mosi_io_num = SPIHOST_PIN_NUM_MOSI;
    buscfg.sclk_io_num = SPIHOST_PIN_NUM_CLK;
    buscfg.quadwp_io_num = -1;
    buscfg.quadhd_io_num = -1;
    buscfg.max_transfer_sz = 1024 * 8;

    devcfg.clock_speed_hz = 4 * 1000 * 1000;  // Clock out at 26 MHz
    devcfg.mode = 0;                          // SPI mode 0
    devcfg.spics_io_num = SPIHOST_PIN_NUM_CS; // CS pin
    devcfg.queue_size = 1;                    // We want to be able to queue 7 transactions at a time
    //.pre_cb=lcd_spi_pre_transfer_callback,      //Specify pre-transfer callback to handle D/C line
    devcfg.command_bits = 8;
    devcfg.address_bits = 8;
    // devcfg.dummy_bits = 32;
    devcfg.cs_ena_pretrans = 1;
    devcfg.cs_ena_posttrans = 16;
    // devcfg.flags = SPI_DEVICE_HALFDUPLEX;

    // Initialize the SPI bus
    ret = spi_bus_initialize(VSPI_HOST, &buscfg, 1 /*dma*/);
    ESP_ERROR_CHECK(ret);
    // Attach the LCD to the SPI bus
    ret = spi_bus_add_device(VSPI_HOST, &devcfg, &spi);
    ESP_ERROR_CHECK(ret);
}

/**
 * @brief
 * @param param
 */
static void spihost_test_task(void* param)
{
    ESP_LOGW(TAG, "spihost_test_task()");
    while(1)
    {
        pm_ref();
        size_t test_buf_size = 1024;
        uint8_t* test_buf = (uint8_t*)malloc(test_buf_size);
        if(test_buf != NULL)
        {
            // ESP_LOGW(TAG, "spihost_test_task() loop ...");
            for(int i = 0; i < test_buf_size; i++)
            {
                test_buf[i] = i & 0xff;
            }

            esp_err_t ret;
            spi_transaction_t t = {};
            t.cmd = 0xAA;
            t.addr = 0x55;
            t.length = test_buf_size * 8;   // Len is in bytes, transaction length is in bits.
            t.rxlength = test_buf_size * 8; // Len is in bytes, transaction length is in bits.
            t.tx_buffer = test_buf;         // Data
            t.rx_buffer = test_buf;         // Data
            // t.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
            ret = spi_device_polling_transmit(spi, &t); // Transmit!
            assert(ret == ESP_OK);                      // Should have had no issues.

            for(int i = 0; i < test_buf_size; i++)
            {
                if(test_buf[i] != (i & 0xff))
                {
                    ESP_LOGW(TAG, "spihost_test_task() payload error test_buf[%04x] != %02x", i, i & 0xff);
                    break;
                }
            }

            free(test_buf);
        }
        pm_unref();
        vTaskDelay(10 / portTICK_PERIOD_MS);
    }
    vTaskDelete(NULL);
}
#endif

/**
 * @brief beeop on/off
 * @param onoff
 */
void beep(int onoff)
{
#ifdef ENABLE_BUZZER
#ifdef BUZZER_PIN
    gpio_num_t gpio = (gpio_num_t)BUZZER_PIN;
    gpio_reset_pin(gpio);
    /* Set the GPIO as a push/pull output */
    gpio_set_direction(gpio, GPIO_MODE_OUTPUT);
    gpio_set_level(gpio, (onoff == 0) ? 0 : 1);
#endif
#endif
}

void powersw(bool onoff)
{
#ifdef CONFIG_ROS2NODE_HW_S2_MOWER
    ESP_LOGE(TAG, "powersw %d", onoff);
    gpio_num_t gpio;
    gpio = (gpio_num_t)GPIO_PWR_ON;
    gpio_hold_dis(gpio);
    gpio_set_pull_mode(gpio, GPIO_PULLUP_PULLDOWN);
    gpio_set_direction(gpio, GPIO_MODE_OUTPUT);
    gpio_set_level(gpio, (onoff == true) ? 1 : 0);
    gpio_hold_en(gpio);

