MS71/LMROS/esp32_fw/main/app_main.cpp
#if 0
    gpio = (gpio_num_t)GPIO_PWR_BUS_ON;
    gpio_hold_dis(gpio);
    gpio_set_pull_mode(gpio, GPIO_PULLUP_PULLDOWN);
    gpio_set_direction(gpio, GPIO_MODE_OUTPUT);
	gpio_set_level(gpio, (onoff==true)?1:0);
    gpio_hold_en(gpio);
#endif

#endif
}

uint8_t g_adccnt = 0;
float g_ubat = 0.0;
float g_usolar = 0.0;
float g_ucharge = 0.0;
float g_uhal = 0.0;
float g_ibat = 0.0;
float g_temperature = -999.0;

static void check_efuse(void)
{
#if CONFIG_IDF_TARGET_ESP32
    // Check if TP is burned into eFuse
    if(esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_TP) == ESP_OK)
    {
        printf("eFuse Two Point: Supported\n");
    }
    else
    {
        printf("eFuse Two Point: NOT supported\n");
    }
    // Check Vref is burned into eFuse
    if(esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_VREF) == ESP_OK)
    {
        printf("eFuse Vref: Supported\n");
    }
    else
    {
        printf("eFuse Vref: NOT supported\n");
    }
#elif CONFIG_IDF_TARGET_ESP32S2
    if(esp_adc_cal_check_efuse(ESP_ADC_CAL_VAL_EFUSE_TP) == ESP_OK)
    {
        printf("eFuse Two Point: Supported\n");
    }
    else
    {
        printf("Cannot retrieve eFuse Two Point calibration values. Default calibration values will be used.\n");
    }
#else
#error "This example is configured for ESP32/ESP32S2."
#endif
}

#define DEFAULT_VREF 1100 // Use adc2_vref_to_gpio() to obtain a better estimate
#define NO_OF_SAMPLES 1   // Multisampling

static esp_adc_cal_characteristics_t* adc_chars;

static void print_char_val_type(esp_adc_cal_value_t val_type)
{
    if(val_type == ESP_ADC_CAL_VAL_EFUSE_TP)
    {
        printf("Characterized using Two Point Value\n");
    }
    else if(val_type == ESP_ADC_CAL_VAL_EFUSE_VREF)
    {
        printf("Characterized using eFuse Vref\n");
    }
    else
    {
        printf("Characterized using Default Vref\n");
    }
}

float adc1_get_voltage(adc1_channel_t channel, float k)
{
    // Configure ADC
    uint32_t adc_reading = 0;
    // Multisampling
    for(int i = 0; i < NO_OF_SAMPLES; i++)
    {
        adc_reading += adc1_get_raw((adc1_channel_t)channel);
    }
    adc_reading /= NO_OF_SAMPLES;
    // Convert adc_reading to voltage in mV
    uint32_t voltage = esp_adc_cal_raw_to_voltage(adc_reading, adc_chars);
    return k * voltage;
}

#ifdef CONFIG_ROS2NODE_HW_S2_MOWER
static void adc1_timer_callback(void* arg)
{
    float k1 = 110.0 / 10.0;
    float k2 = (2.505 / 2.816) * (20.0 / 10.0);
    adc_power_acquire();
    g_ubat = adc1_get_voltage(ADC1_CHANNEL_0, k1) / 1000.0;
    g_usolar = adc1_get_voltage(ADC1_CHANNEL_1, k1) / 1000.0;
    g_ucharge = adc1_get_voltage(ADC1_CHANNEL_2, k1) / 1000.0;
    g_uhal = adc1_get_voltage(ADC1_CHANNEL_3, k2) / 1000.0;
    adc_power_release();
    g_ibat = /*(46.7/2.127) **/ 0.185 * (g_uhal - (5.033 / 2.0));
    // g_ibat = g_uhal;
    if(g_adccnt < 255)
        g_adccnt++;

    wifi_ap_record_t ap_info = {};
    esp_wifi_sta_get_ap_info(&ap_info);
    ESP_LOGW(TAG,
        "cnt=%d ubat=%3.1f usolar=%3.1f ucharge=%3.1f ibat=%1.6f rssi=%d bssid=%02x:%02x:%02x:%02x:%02x:%02x "
        "channel=%d|%d",
        g_adccnt, g_ubat, g_usolar, g_ucharge, g_ibat, ap_info.rssi, ap_info.bssid[0], ap_info.bssid[1],
        ap_info.bssid[2], ap_info.bssid[3], ap_info.bssid[4], ap_info.bssid[5], ap_info.primary, ap_info.second);

    bool enter_sleep = false;

    if(g_adccnt == 10)
    {
        powersw(true);
    }

    if(g_adccnt > 15)
    {
        if(g_ubat < 13.0)
        {
            enter_sleep = true;
        }
        if(g_usolar > (13.8 + 0.3))
        {
            enter_sleep = false;
        }
        if(g_ucharge > (13.8 + 0.3))
        {
            enter_sleep = false;
        }
        if(g_ubat > 13.8)
        {
            enter_sleep = false;
        }
    }
    else if(g_adccnt > 5)
    {
        if(g_ubat < 10.5)
        {
            enter_sleep = true;
        }
    }
    if(enter_sleep == true)
    {
        ESP_LOGW(TAG, "Entering deep sleep (30 minutes)");
        esp_sleep_enable_timer_wakeup(60UL * 60UL * 1000000UL); // sleep 1 hour
        powersw(false);
        esp_wifi_stop();
        esp_deep_sleep_start();
        while(1)
            ;
    }
}
#endif

#ifdef CONFIG_ESP32S2_ULP_COPROC_ENABLED
static void init_ulp_program(void)
{
    esp_err_t err = ulp_load_binary(0, ulp_main_bin_start, (ulp_main_bin_end - ulp_main_bin_start) / sizeof(uint32_t));
    ESP_ERROR_CHECK(err);

#if 0
    /* Configure ADC channel */
    /* Note: when changing channel here, also change 'adc_channel' constant
       in adc.S */
    adc1_config_channel_atten(ADC1_CHANNEL_6, ADC_ATTEN_DB_11);
#if CONFIG_IDF_TARGET_ESP32
    adc1_config_width(ADC_WIDTH_BIT_12);
#elif CONFIG_IDF_TARGET_ESP32S2
    adc1_config_width(ADC_WIDTH_BIT_13);
#endif
#endif

    adc1_ulp_enable();

    /* Set low and high thresholds, approx. 1.35V - 1.75V*/
    ulp_low_thr = 9000;
    ulp_high_thr = 10000;

    /* Set ULP wake up period to 20ms */
    ulp_set_wakeup_period(0, 20000);

    /* Disconnect GPIO12 and GPIO15 to remove current drain through
     * pullup/pulldown resistors.
     * GPIO12 may be pulled high to select flash voltage.
     */
    rtc_gpio_isolate(GPIO_NUM_1);
    // rtc_gpio_isolate(GPIO_NUM_15);
#if CONFIG_IDF_TARGET_ESP32
    esp_deep_sleep_disable_rom_logging(); // suppress boot messages
#endif
}

static void start_ulp_program(void)
{
    /* Reset sample counter */
    ulp_sample_counter = 0;

    /* Start the program */
    esp_err_t err = ulp_run(&ulp_entry - RTC_SLOW_MEM);
    ESP_ERROR_CHECK(err);
}
#endif

/**
 * @brief main
 */
extern "C"
{
    void app_main(void);
}

void app_main(void)
{
    EventBits_t ev;
    beep(1);
    powersw(false);
    // powersw(true);

#ifdef CONFIG_ROS2NODE_HW_S2_MOWER
    // Check if Two Point or Vref are burned into eFuse
    check_efuse();

    // Characterize ADC
    adc_chars = (esp_adc_cal_characteristics_t*)calloc(1, sizeof(esp_adc_cal_characteristics_t));
    esp_adc_cal_value_t val_type =
        esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_DB_6, ADC_WIDTH_BIT_13, DEFAULT_VREF, adc_chars);
    print_char_val_type(val_type);

#ifdef CONFIG_IDF_TARGET_ESP32S2
    temp_sensor_config_t temp_sensor = TSENS_CONFIG_DEFAULT();
    temp_sensor_get_config(&temp_sensor);
    temp_sensor.dac_offset = TSENS_DAC_DEFAULT; // DEFAULT: range:-10℃ ~  80℃, error < 1℃.
    temp_sensor_set_config(temp_sensor);
    temp_sensor_start();
#endif

    adc1_config_width(ADC_WIDTH_BIT_13);
    adc1_config_channel_atten(ADC1_CHANNEL_0, ADC_ATTEN_DB_6);
    adc1_config_channel_atten(ADC1_CHANNEL_1, ADC_ATTEN_DB_6);
    adc1_config_channel_atten(ADC1_CHANNEL_2, ADC_ATTEN_DB_6);
    adc1_config_channel_atten(ADC1_CHANNEL_3, ADC_ATTEN_DB_6);
#endif

#ifdef CONFIG_ESP32S2_ULP_COPROC_ENABLED

    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    if(cause != ESP_SLEEP_WAKEUP_ULP)
    {
        printf("Not ULP wakeup\n");
        init_ulp_program();
    }
    else
    {
        printf("Deep sleep wakeup\n");
        printf("ULP did %d measurements since last reset\n", ulp_sample_counter & UINT16_MAX);
        printf("Thresholds:  low=%d  high=%d\n", ulp_low_thr, ulp_high_thr);
        ulp_last_result &= UINT16_MAX;
        printf("Value=%d was %s threshold\n", ulp_last_result, ulp_last_result < ulp_low_thr ? "below" : "above");
    }
    start_ulp_program();
#endif

#ifdef CONFIG_ESP32S2_ULP_COPROC_ENABLED
    // printf("Entering deep sleep\n\n");
    // ESP_ERROR_CHECK( esp_sleep_enable_ulp_wakeup() );
    // esp_sleep_enable_ulp_wakeup();
    // powersw(false);
    // esp_sleep_enable_timer_wakeup(5000000);
    // esp_deep_sleep_start();
#endif

    esp_chip_info_t chip_info;
    esp_chip_info(&chip_info);
    ESP_LOGI(TAG, "This is ESP32 chip with %d CPU cores, WiFi%s%s, ", chip_info.cores,
        (chip_info.features & CHIP_FEATURE_BT) ? "/BT" : "", (chip_info.features & CHIP_FEATURE_BLE) ? "/BLE" : "");

    ESP_LOGI(TAG, "silicon revision %d, ", chip_info.revision);

    ESP_LOGI(TAG, "%dMB %s flash", spi_flash_get_chip_size() / (1024 * 1024),
        (chip_info.features & CHIP_FEATURE_EMB_FLASH) ? "embedded" : "external");

    ESP_LOGI(TAG, "heap: %d bytes free", xPortGetFreeHeapSize());

    ESP_LOGI(TAG, "init NVS ...");
    esp_err_t err = nvs_flash_init();
    if(err != ESP_OK)
    {
        ESP_LOGW(TAG, "nvs_flash_erase/erase");
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    pm_init();
    pm_ref();

