MS71/LMROS/esp32_fw/main/app_main.cpp
    check_wifi_config();

#if 0
    powersw(true);
    gpio_num_t gpio = (gpio_num_t)I2C_BUS_SCL;
    gpio_reset_pin(gpio);
    /* Set the GPIO as a push/pull output */
    gpio_set_direction(gpio, GPIO_MODE_OUTPUT);
    while(1) 
	{
        //ESP_LOGI(TAG, "0");
		gpio_set_level(gpio, 0);
		vTaskDelay(10 / portTICK_PERIOD_MS);
        //ESP_LOGI(TAG, "1");
		gpio_set_level(gpio, 1);
		vTaskDelay(10 / portTICK_PERIOD_MS);
    }
#endif

    /* start wifi ...
     */
    ESP_LOGI(TAG, "init WIFI ...");
    initialise_wifi();

#if 0
    vTaskDelay(5000 / portTICK_PERIOD_MS);
    while(1)
    {
        ESP_LOGW(TAG, "adc1.0=%d",
            adc1_get_raw((adc1_channel_t)ADC1_CHANNEL_0));
        vTaskDelay(1000 / portTICK_PERIOD_MS);
    }
#endif

#ifdef CONFIG_ENABLE_SPIFS
    ESP_LOGI(TAG, "init SPIFS ...");
    esp_vfs_spiffs_conf_t conf = {
        .base_path = "/spiffs", .partition_label = NULL, .max_files = 5, .format_if_mount_failed = true
    };

    // Use settings defined above to initialize and mount SPIFFS filesystem.
    // Note: esp_vfs_spiffs_register is an all-in-one convenience function.
    esp_err_t ret = esp_vfs_spiffs_register(&conf);

    if(ret != ESP_OK)
    {
        if(ret == ESP_FAIL)
        {
            ESP_LOGE(TAG, "Failed to mount or format filesystem");
        }
        else if(ret == ESP_ERR_NOT_FOUND)
        {
            ESP_LOGE(TAG, "Failed to find SPIFFS partition");
        }
        else
        {
            ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(ret));
        }
    }

    size_t total = 0, used = 0;
    ret = esp_spiffs_info(NULL, &total, &used);
    if(ret != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret));
    }
    else
    {
        ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);
    }
#endif

#if 0
    gpio_num_t gpio = (gpio_num_t)13;
    gpio_reset_pin(gpio);
    /* Set the GPIO as a push/pull output */
    gpio_set_direction(gpio, GPIO_MODE_OUTPUT);
    while(1) 
	{
        ESP_LOGI(TAG, "0");
		gpio_set_level(gpio, 0);
		vTaskDelay(10 / portTICK_PERIOD_MS);
        ESP_LOGI(TAG, "1");
		gpio_set_level(gpio, 1);
		vTaskDelay(10 / portTICK_PERIOD_MS);
    }
#endif

#ifdef CONFIG_ENABLE_I2C
    ESP_LOGI(TAG, "init I2C ...");
    i2c_handler_init();
#endif

#ifdef CONFIG_ENABLE_SDCARD
    sdmmc_init();
    xTaskCreate(&sd_test_task, "sd_test_task", 4096, NULL, DEFAULT_PRIO, NULL);
#endif

#ifdef CONFIG_ENABLE_SPI
    ESP_LOGI(TAG, "starting spi ...");
    spihost_init();
    xTaskCreate(&spihost_test_task, "spihost_test_task", 512, NULL, DEFAULT_PRIO, NULL);
#endif

    /* ... WAIT FOR WIFI ...
     */
    ESP_LOGI(TAG, "Wait until Wifi Connection ... ");
    ev = xEventGroupWaitBits(wifi_event_group, CONNECTED_BIT, false, true, portMAX_DELAY);
    ESP_LOGI(TAG, "... Connected");

#if defined(CONFIG_PARTITION_TABLE_CUSTOM) || defined(CONFIG_PARTITION_TABLE_TWO_OTA)
    ESP_LOGI(TAG, "starting ota ...");
    xTaskCreate(&ota_server_task, "ota_server_task", 4096, NULL, DEFAULT_PRIO, NULL);
#endif

#ifdef CONFIG_ROS2NODE_HW_S2_MOWER
#ifndef CONFIG_ESP32S2_ULP_COPROC_ENABLED
    const esp_timer_create_args_t adc1_timer_args = { .callback = &adc1_timer_callback,
        /* name is optional, but may help identify the timer when debugging */
        .name = "adc1_timer" };
    esp_timer_handle_t adc1_timer;
    ESP_ERROR_CHECK(esp_timer_create(&adc1_timer_args, &adc1_timer));
    /* The timer has been created but is not running yet */

    ESP_ERROR_CHECK(esp_timer_start_periodic(adc1_timer, 1000000));
#endif
#endif

    // my_deflog = esp_log_set_vprintf(my_log);
    // ESP_LOGW(TAG, "ready");

#ifdef CONFIG_ENABLE_ROS2
    ESP_LOGI(TAG, "starting ros2 ...");
    ros2node_init();
    ros2node_start();
#endif

#ifdef CONFIG_ENABLE_GPS
    ESP_LOGI(TAG, "starting gps ...");
    gps_init();
#endif

#ifdef CONFIG_ENABLE_CAMERA
    camera_init();
#endif

    // my_deflog = esp_log_set_vprintf(my_i2clog);

#ifdef CONFIG_ENABLE_WEBUI
    ESP_LOGI(TAG, "starting webui ...");
    webui_init();
#endif

    beep(0);

    pm_unref();

    ESP_LOGI(TAG, "starting console ...");
    console();

    ESP_LOGI(TAG, "... init done. free heap: %u", xPortGetFreeHeapSize());
}

/**
 * EOF
 */
